Документация по использованию всех функций и методов библиотеки: http://pandas.pydata.org/pandas-docs/stable/index.html

In [ ]:
https://drive.google.com/file/d/16NWaK4EidHxGpKpOhju244QPUBBK9l_q/view?usp=sharing

In [1]:
#подключение модуля
import pandas as pd

## Основные объекты Pandas

### Series

это проиндексированный одномерный массив значений. Он похож на простой словарь типа dict, где имя элемента будет соответствовать индексу, а значение – значению записи.

In [5]:
s = pd.Series(data = [1,2,3,4,5], index = 'one two three four five'.split())

In [6]:
s

one      1
two      2
three    3
four     4
five     5
dtype: int64

In [7]:
s.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [8]:
s['one']

1

### DataFrame
 это проиндексированный многомерный массив значений, соответственно каждый столбец DataFrame, является структурой Series

In [2]:
df = pd.DataFrame({'login': 'Ivanov Petrov Sidorov'.split(), 
                   'password': ['25jg4', '54jk56', '6jhu78f']}, 
                  index = [0, 1, 2])

In [3]:
#Выведем датафрейм на экран
df

     login password
0   Ivanov    25jg4
1   Petrov   54jk56
2  Sidorov  6jhu78f

In [23]:
# Извлекаем весь столбец по индексу []
#Способ 1
df['login']

0     Ivanov
1     Petrov
2    Sidorov
Name: login, dtype: object

In [24]:
#Способ 2 через .
df.login

0     Ivanov
1     Petrov
2    Sidorov
Name: login, dtype: object

In [26]:
# Извлекаем отдельный элемент, способ 1 (используем значения индексов и названия столбцов)
df['password'][0]

'25jg4'

In [27]:
df['password']

0      25jg4
1     54jk56
2    6jhu78f
Name: password, dtype: object

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html?highlight=loc#pandas.DataFrame.loc

In [29]:
df.loc[0]['password']

'25jg4'

In [30]:
df.loc[0]

login       Ivanov
password     25jg4
Name: 0, dtype: object

In [38]:
# Извлекаем отдельный элемент, способ 2 (используем номера строк и столбцов)
df.loc[0][1]

'25jg4'

In [ ]:
#Поговорим немного о массивах

In [35]:
# Объединяем два способа
df['password'].iloc[0]

'25jg4'

In [36]:
df.loc[1]

login       Petrov
password    54jk56
Name: 1, dtype: object

## Загружаем датасет и смотрим, что в нем есть

In [39]:
df = pd.read_csv('data.csv')

In [53]:
#Способы просмотра содержимого head tail sample []
df.head()

  order_date        order_id          customer  grand_total
0     9/7/11  CA-2011-100006       Dennis Kane          378
1     7/8/11  CA-2011-100090        Ed Braxton          699
2    3/14/11  CA-2011-100293  Neil Franz�sisch           91
3    1/29/11  CA-2011-100328   Jasper Cacioppo            4
4     4/8/11  CA-2011-100363       Jim Mitchum           21

In [54]:
# Получаем общую информацию о датафрейме
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5009 entries, 0 to 5008
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_date   5009 non-null   object
 1   order_id     5009 non-null   object
 2   customer     5009 non-null   object
 3   grand_total  5009 non-null   int64
dtypes: int64(1), object(3)
memory usage: 156.7+ KB

In [55]:
# Получаем основные статистические данные о количественных показателях
#Будьте осторожны с этим методом при работе с большими датасетами!
df.describe()

        grand_total
count   5009.000000
mean     458.626672
std      954.729307
min        1.000000
25%       38.000000
50%      152.000000
75%      512.000000
max    23661.000000

In [56]:
# Поворачиваем таблицу
df.describe().T

              count        mean         std  min   25%    50%    75%      max
grand_total  5009.0  458.626672  954.729307  1.0  38.0  152.0  512.0  23661.0

In [57]:
#Преобразуем дату
df['order_date'] = pd.to_datetime(df['order_date'])

In [58]:
#Выведем таблицу
df

     order_date        order_id           customer  grand_total
0    2011-09-07  CA-2011-100006        Dennis Kane          378
1    2011-07-08  CA-2011-100090         Ed Braxton          699
2    2011-03-14  CA-2011-100293   Neil Franz�sisch           91
3    2011-01-29  CA-2011-100328    Jasper Cacioppo            4
4    2011-04-08  CA-2011-100363        Jim Mitchum           21
...         ...             ...                ...          ...
5004 2014-11-04  US-2014-168802      Jack O'Briant           18
5005 2014-07-24  US-2014-169320     Lena Hernandez          171
5006 2014-09-08  US-2014-169488       Allen Armold           57
5007 2014-08-29  US-2014-169502  Matthew Grinstein          113
5008 2014-07-08  US-2014-169551          Rob Lucas         1345

[5009 rows x 4 columns]

In [59]:
#Найдем максимальное значение по дате
df['order_date'].max()

Timestamp('2014-12-31 00:00:00')

In [4]:
import datetime as dt
NOW = dt.datetime(2014,12,31)
NOW

datetime.datetime(2014, 12, 31, 0, 0)

## groupby()

In [5]:
rfmTable = df.groupby('customer').agg({'order_date': lambda x: (NOW - x.max()).days, # Recency
                                        'order_id': lambda x: len(x),      # Frequency
                                        'grand_total': lambda x: x.sum()}) # Monetary Value

KeyError: 'customer'

In [63]:
rfmTable['order_date'] = rfmTable['order_date'].astype(int)
rfmTable.rename(columns={'order_date': 'recency', 
                         'order_id': 'frequency', 
                         'grand_total': 'monetary_value'}, inplace=True)

In [64]:
#Что получилось?
rfmTable

                    recency  frequency  monetary_value
customer
Aaron Bergman           415          3             887
Aaron Hawkins            12          7            1744
Aaron Smayling           88          7            3050
Adam Bellavance          54          8            7756
Adam Hart                34         10            3249
...                     ...        ...             ...
Xylona Preis             43         11            2375
Yana Sorensen             9          8            6721
Yoseph Carroll            4          5            5455
Zuschuss Carroll         54         13            8027
Zuschuss Donatelli      202          5            1494

[793 rows x 3 columns]

In [65]:
rfmTable['recency'].max()

1166

In [67]:
rfmTable.info()

<class 'pandas.core.frame.DataFrame'>
Index: 793 entries, Aaron Bergman to Zuschuss Donatelli
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   recency         793 non-null    int32
 1   frequency       793 non-null    int64
 2   monetary_value  793 non-null    int64
dtypes: int32(1), int64(2)
memory usage: 21.7+ KB

In [66]:
#Можно получить конкретное значение
aaron = df[df['customer']=='Aaron Bergman']
aaron

     order_date        order_id       customer  grand_total
624  2011-02-19  CA-2011-152905  Aaron Bergman           13
665  2011-03-07  CA-2011-156587  Aaron Bergman          310
2336 2013-11-11  CA-2013-140935  Aaron Bergman          564

In [68]:
aaron2 = rfmTable[rfmTable['frequency']==7]

In [69]:
aaron2

                  recency  frequency  monetary_value
customer
Aaron Hawkins          12          7            1744
Aaron Smayling         88          7            3050
Adrian Hane            60          7            1734
Alan Shonely          192          7             585
Amy Cox                11          7            5528
...                   ...        ...             ...
Tracy Collins           4          7             743
Tracy Hopkins          72          7            4233
Troy Staebel           55          7            2821
Valerie Mitchum        54          7            2455
Victoria Pisteka       75          7            3361

[116 rows x 3 columns]

## Слияние таблиц

In [70]:
rfm = df.merge(rfmTable, on = 'customer')

In [71]:
rfm

,order_date,order_id,customer,grand_total,recency,frequency,monetary_value
0,2011-09-07,CA-2011-100006,Dennis Kane,378,19,8,3317
1,2012-12-06,CA-2012-131884,Dennis Kane,594,19,8,3317
2,2012-12-12,CA-2012-145065,Dennis Kane,32,19,8,3317
3,2014-07-28,CA-2014-133046,Dennis Kane,298,19,8,3317
4,2014-12-12,CA-2014-165099,Dennis Kane,1,19,8,3317
...,...,...,...,...,...,...,...
5004,2014-03-07,CA-2014-168193,Roland Murray,98,299,1,98
5005,2012-04-02,US-2012-122140,Michael Oakman,130,180,2,154
5006,2014-07-04,US-2014-166233,Michael Oakman,24,180,2,154
5007,2012-07-19,US-2012-160150,Thais Sissman,2,357,2,5
5008,2014-01-08,US-2014-168690,Thais Sissman,3,357,2,5

## pivot_table()

In [81]:
# Считаем среднее значение потраченной суммы по сегментам
rfm.pivot_table(values = 'monetary_value', index = 'frequency', aggfunc = 'mean')

           monetary_value
frequency
1              430.583333
2              780.088235
3             1366.226415
4             1819.197917
5             2517.626866
6             2784.897196
7             3426.465517
8             3605.219512
9             3462.957746
10            4374.717949
11            5506.739130
12            6178.000000
13            4321.714286
17            5479.000000

In [84]:
rfm.pivot_table(values = 'monetary_value', index = 'frequency', aggfunc = ["min", 'mean', "max"])

                     min           mean            max
          monetary_value monetary_value monetary_value
frequency
1                      5     430.583333           1058
2                      5     780.088235           5254
3                     49    1366.226415           9350
4                     72    1819.197917          14595
5                    201    2517.626866          25042
6                    269    2784.897196          15117
7                    432    3426.465517          10605
8                    684    3605.219512          11166
9                    775    3462.957746          14143
10                  1255    4374.717949          14474
11                  1082    5506.739130          12210
12                  2441    6178.000000          14174
13                  2847    4321.714286           8027
17                  5479    5479.000000           5479

In [85]:
# Считаем минимальную, среднюю и максимальную сумму покупки в зависимости от группы по R
rfm.groupby(by = 'frequency')['monetary_value'].agg(['min', 'mean', 'max'])

            min         mean    max
frequency
1             5   430.583333   1058
2             5   780.088235   5254
3            49  1366.226415   9350
4            72  1819.197917  14595
5           201  2517.626866  25042
6           269  2784.897196  15117
7           432  3426.465517  10605
8           684  3605.219512  11166
9           775  3462.957746  14143
10         1255  4374.717949  14474
11         1082  5506.739130  12210
12         2441  6178.000000  14174
13         2847  4321.714286   8027
17         5479  5479.000000   5479

## Определение RFM Quartiles

In [73]:
quantiles = rfmTable.quantile(q=[0.25,0.5,0.75])

In [74]:

quantiles = rfmTable.quantile(q=[0.25,0.5,0.75])

## Creating the RFM segmentation table

In [75]:
quantiles = rfmTable.quantile(q=[0.25,0.5,0.75])

In [76]:
quantiles = rfmTable.quantile(q=[0.25,0.5,0.75])

In [77]:
# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def RClass(x,p,d):
    if x <= d[p][0.25]:
        return 1
    elif x <= d[p][0.50]:
        return 2
    elif x <= d[p][0.75]: 
        return 3
    else:
        return 4
    
# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def FMClass(x,p,d):
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.50]:
        return 3
    elif x <= d[p][0.75]: 
        return 2
    else:
        return 1

In [78]:
rfm['R_Quartile'] = rfm['recency'].apply(RClass, args=('recency',quantiles,))
rfm['F_Quartile'] = rfm['frequency'].apply(FMClass, args=('frequency',quantiles,))
rfm['M_Quartile'] = rfm['monetary_value'].apply(FMClass, args=('monetary_value',quantiles,))

In [79]:

rfm['RFMClass'] = rfm.R_Quartile.map(str) \
                            + rfm.F_Quartile.map(str) \
                            + rfm.M_Quartile.map(str)

In [ ]:
map()

In [82]:
rfm

,order_date,order_id,customer,grand_total,recency,frequency,monetary_value,R_Quartile,F_Quartile,M_Quartile,RFMClass
0,2011-09-07,CA-2011-100006,Dennis Kane,378,19,8,3317,1,2,2,122
1,2012-12-06,CA-2012-131884,Dennis Kane,594,19,8,3317,1,2,2,122
2,2012-12-12,CA-2012-145065,Dennis Kane,32,19,8,3317,1,2,2,122
3,2014-07-28,CA-2014-133046,Dennis Kane,298,19,8,3317,1,2,2,122
4,2014-12-12,CA-2014-165099,Dennis Kane,1,19,8,3317,1,2,2,122
...,...,...,...,...,...,...,...,...,...,...,...
5004,2014-03-07,CA-2014-168193,Roland Murray,98,299,1,98,4,4,4,444
5005,2012-04-02,US-2012-122140,Michael Oakman,130,180,2,154,3,4,4,344
5006,2014-07-04,US-2014-166233,Michael Oakman,24,180,2,154,3,4,4,344
5007,2012-07-19,US-2012-160150,Thais Sissman,2,357,2,5,4,4,4,444
5008,2014-01-08,US-2014-168690,Thais Sissman,3,357,2,5,4,4,4,444

In [87]:
rfm.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5009 entries, 0 to 5008
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   order_date      5009 non-null   datetime64[ns]
 1   order_id        5009 non-null   object
 2   customer        5009 non-null   object
 3   grand_total     5009 non-null   int64
 4   recency         5009 non-null   int32
 5   frequency       5009 non-null   int64
 6   monetary_value  5009 non-null   int64
 7   R_Quartile      5009 non-null   int64
 8   F_Quartile      5009 non-null   int64
 9   M_Quartile      5009 non-null   int64
 10  RFMClass        5009 non-null   object
dtypes: datetime64[ns](1), int32(1), int64(6), object(3)
memory usage: 610.0+ KB

In [80]:
rfm.pivot_table(values = 'monetary_value', index = 'RFMClass', aggfunc = 'mean')

          monetary_value
RFMClass
111          6004.556270
112          2905.570755
113          1713.644068
114          1057.000000
121          5371.371795
...                  ...
434           717.250000
441          8174.723404
442          2722.640449
443          1631.398551
444           612.819444

[62 rows x 1 columns]

In [86]:
rfm.groupby(by = 'RFMClass')['monetary_value'].mean()

RFMClass
111    6004.556270
112    2905.570755
113    1713.644068
114    1057.000000
121    5371.371795
          ...
434     717.250000
441    8174.723404
442    2722.640449
443    1631.398551
444     612.819444
Name: monetary_value, Length: 62, dtype: float64

## Самостоятельно
можно поработать, например, со следующим датасетом
https://raw.githubusercontent.com/plotly/datasets/master/2016-weather-data-seattle.csv

In [7]:
import pandas as pd
df = pd.read_csv('2016-weather-data-seattle.csv')
df

             Date  Max_TemperatureC  Mean_TemperatureC  Min_TemperatureC
0        1/1/1948                10                8.0               7.0
1        1/2/1948                 6                4.0               3.0
2        1/3/1948                 7                4.0               2.0
3        1/4/1948                 7                4.0               2.0
4        1/5/1948                 7                3.0               0.0
...           ...               ...                ...               ...
24376  12/27/2015                 4                3.0               2.0
24377  12/28/2015                 5                3.0               2.0
24378  12/29/2015                 7                4.0               1.0
24379  12/30/2015                 6                2.0              -1.0
24380  12/31/2015                 6                2.0              -2.0

[24381 rows x 4 columns]

In [22]:
df.iloc[2:10:3, 1:3]

   Max_TemperatureC  Mean_TemperatureC
2                 7                4.0
5                 9                7.0
8                 9                4.0